#include<stdio.h>

int main(){
	// 5: %.1lf  %.2lf  %lf
	printf("%.1lf\\%.2lf\\%lf\\%f\\\t%.10lf\\%.10f\n", 8.0/5.0,8.0/5.0,8.0/5.0,8.0/5.0,8.0/5.0,8.0/5.0);
	// out: 1.6\1.60\1.600000\1.600000\		\1.600000000\1.600000000
	//.n n为取小数点后几位 深入理解计算机体系中有讲float精度为6到7，double精度为15到16. 取值范围决定于前边的指数。
	//在编译器中会自动默认取小数点后6位
	
	
	// 6: %.1lf不变， 8.0/5.0 变成 8/5 输出？ 我的预测：1.6 和 1.0
	printf("%.1lf\t%.1lf\n", 8.0/5.0,8/5);
	// 做错了,实际输出1.6, 1.6,原因涉及printf函数中整数和浮点数编码问题
	float a = 8/5;  // temp =8/5(这个是int)  a=temp(int - float)
	printf("%.1lf\n",a); //输出1.0
	
	// 7: 8.0/5.0不变， %.1lf 变成 %d
	printf("%.1lf\t%d\n",8.0/5.0,8.0/5.0); // 输出：1.6     -1717986918 原因涉及到整数和浮点数编码
	
	/* 总结：
	*  1. 整数输出用%d, 实数输出用%lf
	*  2. 整数/整数=整数，浮点数/浮点数=浮点数 
	*  3. 整数-浮点数=浮点数（整数先变成浮点数再运算）
	*
	*/
	
	return 0;
}